app/controllers/be_follows_controller.rb

  def create
    @be_follow = BeFollow.new(params[:be_follow])
    @be_follow.user=@user
    @be_follow.follower=current_user
    respond_to do |format|
      if @be_follow.save
        @user.value=@user.value+3
        @user.save
        n=@user.news.create
        n.owner=@user
        n.follower_id=current_user.id
        if @be_follow.provide_name?
          n.news_type="friend_follow"
        else
          n.news_type="stranger_follow"
        end
        n.save
---
INSERT INTO `be_follows` (`provide_name`, `created_at`, `updated_at`, `follower_id`, `user_id`) VALUES(0, '2009-08-31 12:10:37', '2009-08-31 12:10:37', 1, 2)
INSERT INTO `news` (`created_at`, `resource_id`, `updated_at`, `follower_id`, `user_id`, `news_type`, `comment_id`) VALUES('2009-08-31 12:10:38', NULL, '2009-08-31 12:10:38', NULL, 2, NULL, NULL)
UPDATE `users` SET `updated_at` = '2009-08-31 12:10:38', `value` = 6.0 WHERE `id` = 2
UPDATE `news` SET `updated_at` = '2009-08-31 12:10:38', `news_type` = 'stranger_follow', `follower_id` = 1 WHERE `id` = 15

  def load_user
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1