app/controllers/be_follows_controller.rb

SELECT * FROM `be_follows` WHERE (`be_follows`.user_id = 2)
---
  def index
    @be_follows = BeFollow.all