app/controllers/comments_controller.rb

SELECT * FROM `keyword_pages` WHERE (`keyword_pages`.`keyword` = 'Michael') LIMIT 1
SELECT * FROM `comments` WHERE (`comments`.parent_comment_id = 1)
SELECT count(*) AS count_all FROM `comments` WHERE (resource_id=12 and parent_comment_id is NULL)
---
  def index
    @keyword_page=KeywordPage.find_by_keyword(@resource.keywords)
    @related_keywords=@keyword_page.related_keywords
    @comments=Comment.find_parent_comments(@resource,params[:page])

INSERT INTO `comments` (`rating`, `created_at`, `resource_id`, `updated_at`, `user_id`, `content`, `parent_comment_id`) VALUES(-1, '2009-09-08 13:46:04', 12, '2009-09-08 13:46:04', 1, 'asefas', NULL)
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
INSERT INTO `news` (`created_at`, `resource_id`, `updated_at`, `follower_id`, `user_id`, `news_type`, `comment_id`) VALUES('2009-09-08 06:08:01', NULL, '2009-09-08 06:08:01', NULL, 1, NULL, NULL)
UPDATE `news` SET `updated_at` = '2009-09-08 06:08:02', `resource_id` = 10, `news_type` = 'comment' WHERE `id` = 16
---
  def create
    @comment = @resource.comments.build(params[:comment])
    @comment.owner=current_user
    if @comment.save
      u=User.find(@comment.owner)
      if not u==current_user
        if current_user.value(@resource.keyword_page)<0 and params[:comment][:rating].to_i<0
          flash[:notice]="不太爽的是，这个领域内你的价值点数低于0了，暂时不能作出这种中肯评价。"
        elsif current_user.value(@resource.keyword_page)>=0 and params[:comment][:rating].to_i<0
          flash[:notice]="差评成功，你的价值点数降低了0.5，对方降低了1.0"
          u.change_value(@resource.keyword_page,params[:comment][:rating].to_i)
          current_user.change_value(@resource.keyword_page,-0.5)
          current_user.save
        else
          flash[:notice]="评论成功"
          u.change_value @resource.keyword_page,params[:comment][:rating].to_i
          u.save
        end
      end
        n=@resource.owner.news.create
        n.news_type="comment"
        n.comment=@comment
        n.resource=@resource
        n.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
SELECT * FROM `resources` WHERE (`resources`.`id` = 1) AND ( (`resources`.`type` = 'LinkUrlResource' ) )
---
    def load_user_and_resource
      @user=User.find(params[:user_id])
      @resource=Resource.find(params[:resource_id])