app/controllers/controlled_keywords_controller.rb

  def index
    @keywords = @user.owned_keywords
    @controlled_keywords=@keywords.map do |k|
      rs=Resource.scoped_by_keywords(k)
      top_owner=rs.by_owner_value.first
---
SELECT * FROM `resources` WHERE (`resources`.user_id = 1)

  def load_user
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1