app/controllers/keyword_pages_controller.rb

SELECT * FROM `related_keywords` WHERE (`related_keywords`.keyword_page_id = 2)
---
  def show
    if logged_in?
      @user=current_user
      @blog_resource=current_user.blog_resources.build
    end
    @keyword_page=KeywordPage.find(params[:id])
    session[:current_keyword_page_id]=(params[:id])
    @related_keywords=@keyword_page.related_keywords
    @users=@keyword_page.users_by_value.paginate(:page => params[:page],:per_page => 10)