app/controllers/keyword_pages_controller.rb

SELECT * FROM `keyword_pages` WHERE (`keyword_pages`.`keyword` IS NULL) LIMIT 1
INSERT INTO `keyword_pages` (`created_at`, `updated_at`, `keyword`) VALUES('2009-07-31 01:13:54', '2009-07-31 01:13:54', NULL)
SELECT `users`.id FROM `users` INNER JOIN `be_follows` ON `users`.id = `be_follows`.user_id WHERE (`users`.`id` = 1) AND ((`be_follows`.user_id = 2)) ORDER BY value DESC LIMIT 1
---
  def show
    @keyword_page=KeywordPage.find(params[:id])
    if logged_in? and !current_user.keyword_pages.include?(@keyword_page)
      current_user.keyword_pages<<@keyword_page
    end
    if logged_in?
      @user=current_user
      @news=News.list_self_news(@user)
      @resource=@keyword_page.resources.build
    end
    @per_page=10
    @users=@keyword_page.users_have_resources.paginate(:page => params[:page],:per_page => @per_page)