app/controllers/link_url_resources_controller.rb

  def add_value
    o=Resource.find(params[:id]).owner
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 1)