app/controllers/link_url_resources_controller.rb

  def create
    @link_url_resource=current_user.link_url_resources.build(params[:link_url_resource])
    @link_url_resource.keywords=params[:resource][:keywords]
    if @link_url_resource.save
      KeywordPage.create(:keyword => @link_url_resource.keywords)
      render :partial => "succeed",:layout => "link_url_resources"
      n=current_user.news.create
      n.news_type="link_url_resource"
      n.owner=current_user
      n.resource=@link_url_resource
      n.save
---
INSERT INTO `resources` (`created_at`, `title`, `updated_at`, `type`, `user_id`, `form`, `content`, `authority`, `shoulu`, `description`, `keyword_page_id`, `keywords`, `link_url`) VALUES('2009-07-31 04:53:57', NULL, '2009-07-31 04:53:57', 'LinkUrlResource', 1, '文字、文档', NULL, 0, 1, 'asdf', NULL, 'ac', 'http://asdf')
INSERT INTO `keyword_pages` (`created_at`, `resource_id`, `updated_at`, `keyword`) VALUES('2009-07-31 01:19:34', 4, '2009-07-31 01:19:34', 'asdf')
INSERT INTO `news` (`created_at`, `resource_id`, `updated_at`, `follower_id`, `user_id`, `news_type`, `comment_id`) VALUES('2009-08-31 02:03:51', NULL, '2009-08-31 02:03:51', NULL, 1, NULL, NULL)
UPDATE `news` SET `updated_at` = '2009-08-31 02:03:51', `resource_id` = 9, `news_type` = 'link_url_resource' WHERE `id` = 9

  def minus_value
    o=Resource.find(params[:id]).owner
    if !current_user==o and current_user.value<0
      flash[:notice]="不太爽的是，你的价值点数低于0了，暂时不能作出这种中肯评价。"
    else
      o.value=o.value-0.6
      current_user.value=current_user.value-0.3
      current_user.save
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
UPDATE `users` SET `updated_at` = '2009-08-01 10:06:39', `value` = -1.0 WHERE `id` = 1

  def find_user
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) ORDER BY value DESC LIMIT 1