app/controllers/news_controller.rb

  def load_user
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1