app/controllers/related_keywords_controller.rb

  def create
    @related_keyword=@keyword_page.related_keywords.build(:name => params[:resource][:keywords])
    if @related_keyword.save
      flash[:notice]="修改成功"
      k=KeywordPage.find_by_keyword(@related_keyword.name)
---
INSERT INTO `related_keywords` (`name`, `created_at`, `updated_at`, `auto`, `keyword_page_id`) VALUES('aaa', '2009-08-01 07:58:12', '2009-08-01 07:58:12', 0, 2)
SELECT * FROM `keyword_pages` WHERE (`keyword_pages`.`keyword` IS NULL) LIMIT 1
SELECT `related_keywords`.id FROM `related_keywords` WHERE (`related_keywords`.`name` = BINARY 'related' AND `related_keywords`.keyword_page_id = 1) LIMIT 1

  def destroy
    related_keyword=@keyword_page.related_keywords.find(params[:id])
    if !related_keyword.auto?
      related_keyword.destroy
---
SELECT * FROM `related_keywords` WHERE (`related_keywords`.`id` = 2 AND (`related_keywords`.keyword_page_id = 1))
DELETE FROM `related_keywords` WHERE `id` = 2

  def find_keyword_page
    @user=User.find(current_user)
    @keyword_page=KeywordPage.find(params[:keyword_page_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
SELECT * FROM `keyword_pages` WHERE (`keyword_pages`.`id` = 1)