app/controllers/replied_comments_controller.rb

  def create
    @replied_comment=@resource.comments.build(params[:comment])
    @replied_comment.parent_comment=@comment
    @replied_comment.owner=current_user
    if @replied_comment.save
      n=@replied_comment.parent_comment.owner.news.build
      n.news_type="be_replied_comment"
      n.resource=@resource
      n.comment=@replied_comment
      n.save
---
INSERT INTO `comments` (`rating`, `created_at`, `resource_id`, `updated_at`, `user_id`, `content`, `parent_comment_id`) VALUES(0, '2009-09-08 13:47:57', 12, '2009-09-08 13:47:57', 1, 'see\r\n', 11)
INSERT INTO `news` (`created_at`, `resource_id`, `updated_at`, `follower_id`, `user_id`, `news_type`, `comment_id`) VALUES('2009-09-08 13:47:57', 12, '2009-09-08 13:47:57', NULL, 1, 'replied_comment', 13)

  def find_user_and_resource_and_comment
    @user=User.find(params[:user_id])
    @resource=Resource.find(params[:resource_id])
    @comment=Comment.find(params[:comment_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
SELECT * FROM `comments` WHERE (`comments`.`id` = 11)