app/controllers/replies_controller.rb

INSERT INTO `replies` (`created_at`, `resource_id`, `updated_at`, `user_id`, `content`) VALUES('2009-09-08 13:38:42', 18, '2009-09-08 13:38:42', 1, 'www')
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
INSERT INTO `news` (`created_at`, `resource_id`, `updated_at`, `follower_id`, `user_id`, `news_type`, `comment_id`) VALUES('2009-09-08 13:38:42', NULL, '2009-09-08 13:38:42', NULL, 1, NULL, NULL)
UPDATE `news` SET `updated_at` = '2009-09-08 13:38:42', `resource_id` = 18, `news_type` = 'twitter_resource_reply' WHERE `id` = 24
---
  def create
    @reply = @twitter_resource.replies.build(params[:reply])
    @reply.owner=current_user
    respond_to do |format|
      if @reply.save
        u=User.find(params[:user_id])
        u.value=u.value+0.2
        u.save
        n=@twitter_resource.owner.news.create
        n.owner=@twitter_resource.owner
        n.resource=@twitter_resource
        n.news_type="twitter_resource_reply"
        n.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
---
  def find_user_and_resource
    @user=User.find(params[:user_id])