app/controllers/resources_controller.rb

SELECT * FROM `resources` WHERE (`resources`.user_id = 1) AND ( (`resources`.`type` = 'LinkUrlResource' ) )
---
  def index
    @news=News.list_self_news(current_user,params[:page])
    if @user.link_url_resources.blank?

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
---
  def load_user
    @user=User.find(params[:user_id])