app/controllers/searched_keywords_controller.rb

SELECT * FROM `keyword_pages` WHERE (`keyword_pages`.`keyword` = 'Michael') LIMIT 1
SELECT `searched_keywords`.id FROM `searched_keywords` WHERE (`searched_keywords`.`name` = BINARY 'Michael' AND `searched_keywords`.user_id = '1' AND `searched_keywords`.id <> 1) LIMIT 1
INSERT INTO `searched_keywords` (`name`, `created_at`, `updated_at`, `searched_times`, `user_id`) VALUES('Michael', '2009-08-31 02:04:02', '2009-08-31 02:04:02', 1, 1)
UPDATE `searched_keywords` SET `updated_at` = '2009-08-31 02:04:33', `searched_times` = 2 WHERE `id` = 1
---
  def create
    keyword_page=KeywordPage.find_by_keyword(params[:keywords])
    render :update do |page|
      page.redirect_to "/keyword_pages/#{keyword_page.id}"
    end
    if current_user.searched_keywords.find_by_name(params[:keywords]).blank?
      s=current_user.searched_keywords.create(:name => params[:keywords])
    else
      s=current_user.searched_keywords.find_by_name(params[:keywords])
      s.searched_times=s.searched_times+1
      s.save