app/controllers/twitter_resources_controller.rb

INSERT INTO `resources` (`created_at`, `title`, `updated_at`, `type`, `user_id`, `form`, `authority`, `content`, `shoulu`, `description`, `keywords`, `link_url`) VALUES('2009-08-31 01:34:56', NULL, '2009-08-31 01:34:56', 'TwitterResource', 1, NULL, 0, '试一下试一下', 1, NULL, NULL, NULL)
INSERT INTO `news` (`created_at`, `resource_id`, `updated_at`, `follower_id`, `user_id`, `news_type`, `comment_id`) VALUES('2009-08-31 01:34:56', NULL, '2009-08-31 01:34:56', NULL, 1, NULL, NULL)
UPDATE `news` SET `updated_at` = '2009-08-31 01:34:56', `resource_id` = 5, `news_type` = 'twitter_resource' WHERE `id` = 5
---
  def create
    @twitter_resource=@user.twitter_resources.build(params[:twitter_resource])
    if  @twitter_resource.save and @twitter_resource.errors.blank?
      flash[:notice]='<p>你说了一些不知道是什么东西的东西。你可以选择回到Michael页面，搜索一下你刚才的胡言乱语试试。</p>
<p></p>
        <p>或者开始另一段胡言乱语.</p>'
      @twitter_resource.create_keyword_page(:keyword => @twitter_resource.keywords)
      n= current_user.news.create
      n.owner=current_user
      n.resource=@twitter_resource
      n.news_type="twitter_resource"
      n.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
---
  def find_user
    @user=User.find(params[:user_id])