app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `username`, `value`, `remember_token`, `nick_name`, `birthday`, `terms`, `mobile_phone`, `email`) VALUES(NULL, '8d1cee34f57df4c2524434d130c0101b9f9fc1d0', '2009-08-01 08:43:24', 'f55254bcd3a04967871b1c05672abbe7b24cc02e', NULL, '2009-08-01 08:43:24', 'michael', 0.0, NULL, NULL, NULL, 1, NULL, NULL)
---
  def create
    session[:user_id]=nil
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
---
  def edit
    @user=User.find(current_user)

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
UPDATE `users` SET `updated_at` = '2009-07-31 05:50:35', `name` = '123', `nick_name` = 'Michael', `birthday` = '1970-07-31' WHERE `id` = 1
SELECT `users`.* FROM `users` INNER JOIN `follows` ON `users`.id = `follows`.user_id WHERE ((`follows`.user_id = 2)) ORDER BY value DESC
---
  def update
    @user = User.find(params[:id])
    if  @user.update_attributes(params[:user])
      if session[:inviter_id].present? and self.last_ip!=User.find(session[:inviter_id]).last_ip
        b=BeFollow.new
        b.user=User.find(session[:inviter_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
---
  def show
    @user=User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`name` = 'liuz') ORDER BY value DESC
SELECT * FROM `users` WHERE (`users`.`id` = 1) ORDER BY value DESC LIMIT 1
---
  def search
    @user=current_user
    if params[:user][:name] and params[:user][:id].blank?
      @results=User.scoped_by_name(params[:user][:name])
    elsif params[:user][:id] and params[:user][:name].blank?
      @result=User.find_by_id(params[:user][:id])